In [1]:
import sqlite3
import json
import os
import pandas as pd

DB_PATH = "/Users/atissera/Developer/atissera/repos/tesis/spider_data/test_database"
PREDICTIONS = "/Users/atissera/Developer/atissera/repos/tesis/spider_data/test.json"

with open(PREDICTIONS) as f:
    predictions = json.load(f)

for item in predictions[:5]:
    db_id = item["db_id"]
    query = item["query"]
    db_file = os.path.join(DB_PATH, db_id, db_id + ".sqlite")
    if not os.path.exists(db_file):
        print(f"‚ùå Database file not found: {db_file}")
        continue

    try:
        conn = sqlite3.connect(db_file)
        cursor = conn.cursor()
        cursor.execute(query)
        columns = [description[0] for description in cursor.description]  # get column names
        rows = cursor.fetchall()
        conn.close()

        result_df = pd.DataFrame(rows, columns=columns)
        print(f"üìå Database: {db_id} | Query:\n{query}")
        display(result_df)
    except Exception as e:
        print(f"‚ùå Error running query on {db_id}: {query}")
        print(e)

üìå Database: soccer_3 | Query:
SELECT count(*) FROM club

   count(*)
0         9

üìå Database: soccer_3 | Query:
SELECT count(*) FROM club

   count(*)
0         9

üìå Database: soccer_3 | Query:
SELECT Name FROM club ORDER BY Name ASC

               Name
0           Arsenal
1       Aston Villa
2  Blackburn Rovers
3  Bolton Wanderers
4           Chelsea
5           Everton
6            Fulham
7         Hull City
8         Liverpool

üìå Database: soccer_3 | Query:
SELECT Name FROM club ORDER BY Name ASC

               Name
0           Arsenal
1       Aston Villa
2  Blackburn Rovers
3  Bolton Wanderers
4           Chelsea
5           Everton
6            Fulham
7         Hull City
8         Liverpool

üìå Database: soccer_3 | Query:
SELECT Manager ,  Captain FROM club

          Manager         Captain
0   Ars√®ne Wenger   Cesc F√†bregas
1  Martin O'Neill  Martin Laursen
2   Sam Allardyce     Ryan Nelsen
3     Gary Megson    Kevin Davies
4    Guus Hiddink      John Terry
5     David Moyes    Phil Neville
6     Roy Hodgson    Danny Murphy
7      Phil Brown      Ian Ashbee
8  Rafael Ben√≠tez  Steven Gerrard